![alt text](http://pandas.pydata.org/_static/pandas_logo.png)

<center><h1> PANDAS TABLE OF CONTENTS </h1></center>

## [Essential Basic Functionality](http://pandas.pydata.org/pandas-docs/stable/basics.html)

- [Head and Tail](#Head-and-Tail)
- [Attributes and the raw ndaray](#Attributes-and-the-raw-ndaray)
- [Accelerate operations](#Accelerate-operations)
- [Flexible binary operations](#Flexible-binary-operations)
- [Descriptive statistics](#Descriptive-statistics)
- [Function applicaton](#Function-applicaton)
- [Reindexing and altering labels](#Reindexing-and-altering-labels)
- [Iteration](#Iteration)
- [.dt-accessor](#.dt-accessor)
- [Vecorized string methods](#Vecorized-string-methods)
- [Sorting](#Sorting)
- [Copying](#Copying)
- [dtypes](#dtypes)

Here we discuss a lot of the essential functionality common to the pandas data structures. Here’s how to create some of the objects used in the examples from the previous section:

In [3]:
import pandas as pd
import numpy as np

In [4]:
index = pd.date_range('1/1/2000', periods = 8)

In [5]:
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [6]:
s = pd.Series(np.random.rand(5), index = ['a', 'b', 'c', 'd', 'e'])

In [7]:
df = pd.DataFrame(np.random.randn(8, 3), index = index,
                 columns = ['A', 'B', 'C'])

In [8]:
df

                   A         B         C
2000-01-01 -1.101994 -1.722728 -1.341667
2000-01-02  1.074900  0.230318  0.155521
2000-01-03  0.910731 -0.246496  0.074840
2000-01-04 -0.939314 -0.940890 -0.305041
2000-01-05  0.461511 -0.254858 -0.159353
2000-01-06 -0.292855  0.060352  0.754768
2000-01-07  0.222525 -0.018138  0.609716
2000-01-08  0.303977 -0.375029 -1.772556

In [9]:
 wp = pd.Panel(np.random.randn(2, 5, 4), items=['Item1', 'Item2'],
               major_axis=pd.date_range('1/1/2000', periods=5),
               minor_axis=['A', 'B', 'C', 'D'])

## Head and Tail

To view a small sample of a Series or DataFrame object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [13]:
long_series = pd.Series(np.random.randn(1000))

In [14]:
long_series.head()

0   -0.702765
1    1.244324
2   -0.293079
3    0.232502
4   -2.334224
dtype: float64

In [16]:
long_series.tail(3)

997   -2.264176
998   -0.985780
999   -0.788931
dtype: float64

## Attributes and the raw ndaray

pandas objects have a number of attributes enabling you to access the metadata

* **shape:** gives the axis dimensions of the object, consistent with ndarray
* Axis labels
  * **Series:** index (only axis)
  * **DataFrame:** index (rows) and columns
  * **Panel:** items, major_axis, and minor_axis

Note, **these attributes can be safely assigned to!**

In [17]:
df[:2]

                   A         B         C
2000-01-01 -1.101994 -1.722728 -1.341667
2000-01-02  1.074900  0.230318  0.155521

In [18]:
df.columns = [x.lower() for x in df.columns]

In [19]:
df

                   a         b         c
2000-01-01 -1.101994 -1.722728 -1.341667
2000-01-02  1.074900  0.230318  0.155521
2000-01-03  0.910731 -0.246496  0.074840
2000-01-04 -0.939314 -0.940890 -0.305041
2000-01-05  0.461511 -0.254858 -0.159353
2000-01-06 -0.292855  0.060352  0.754768
2000-01-07  0.222525 -0.018138  0.609716
2000-01-08  0.303977 -0.375029 -1.772556

To get the actual data inside a data structure, one need only access the **values** property

In [20]:
s.values

array([ 0.57570467,  0.28086173,  0.13720265,  0.35516233,  0.48849201])

In [21]:
df.values

array([[-1.10199385, -1.72272819, -1.34166749],
       [ 1.07489971,  0.23031829,  0.15552062],
       [ 0.91073092, -0.2464963 ,  0.0748402 ],
       [-0.93931398, -0.9408898 , -0.3050411 ],
       [ 0.46151127, -0.25485759, -0.1593526 ],
       [-0.29285546,  0.06035166,  0.75476781],
       [ 0.22252522, -0.0181383 ,  0.6097162 ],
       [ 0.30397713, -0.3750288 , -1.7725558 ]])

In [22]:
wp.values

array([[[ 1.8418    , -2.14536724,  0.37094418,  0.04166484],
        [ 1.14774695,  0.44682272, -0.8416782 , -1.0477633 ],
        [-0.05801218,  0.59397592, -0.1727015 , -0.32228237],
        [ 0.16070069, -0.40686287,  0.85947005,  0.06764598],
        [ 1.27033079, -2.62317707, -0.19729403, -0.54779117]],

       [[ 0.21086528, -0.34628053,  0.16887097,  0.65929494],
        [ 0.49031298, -0.07793252, -0.56851636, -1.75309483],
        [-0.19943855,  2.60588556,  0.27831847,  0.36817091],
        [-1.59457969,  0.63196644, -0.42496429,  0.97118989],
        [-0.05315063,  1.11325034,  0.20286807,  1.31114808]]])

If a DataFrame or Panel contains homogeneously-typed data, the ndarray can actually be modified in-place, and the changes will be reflected in the data structure. For heterogeneous data (e.g. some of the DataFrame’s columns are not all the same dtype), this will not be the case. The values attribute itself, unlike the axis labels, cannot be assigned to.

**Note:** When working with heterogeneous data, the dtype of the resulting ndarray will be chosen to accommodate all of the data involved. For example, if strings are involved, the result will be of object dtype. If there are only floats and integers, the resulting array will be of float dtype.

## Accelerate operations

pandas has support for accelerating certain types of binary numerical and boolean operations using the numexpr library (starting in 0.11.0) and the bottleneck libraries.

These libraries are especially useful when dealing with large data sets, and provide large speedups. numexpr uses smart chunking, caching, and multiple cores. bottleneck is a set of specialized cython routines that are especially fast when dealing with arrays that have nans.

Here is a sample (using 100 column x 100,000 row DataFrames):

<table border="1" class="docutils" align = "left">
<colgroup>
<col width="25%" />
<col width="25%" />
<col width="25%" />
<col width="25%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Operation</th>
<th class="head">0.11.0 (ms)</th>
<th class="head">Prior Version (ms)</th>
<th class="head">Ratio to Prior</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">df1</span> <span class="pre">&gt;</span> <span class="pre">df2</span></tt></td>
<td>13.32</td>
<td>125.35</td>
<td>0.1063</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">df1</span> <span class="pre">*</span> <span class="pre">df2</span></tt></td>
<td>21.71</td>
<td>36.63</td>
<td>0.5928</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">df1</span> <span class="pre">+</span> <span class="pre">df2</span></tt></td>
<td>22.04</td>
<td>36.50</td>
<td>0.6039</td>
</tr>
</tbody>
</table>

You are highly encouraged to install both libraries. See the section Recommended Dependencies for more installation info.

## Flexible binary operations

With binary operations between pandas data structures, there are two key points of interest:

* Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.
* Missing data in computations

We will demonstrate how to manage these issues independently, though they can be handled simultaneously.

### Matching / broadcasting behavior

DataFrame has the methods **add()**, **sub()**, **mul()**, **div()** and related functions **radd()**, **rsub()**, ... for carrying out binary operations. For broadcasting behavior, Series input is of primary interest. Using these functions, you can use to either match on the index or columns via the **axis** keyword:

In [23]:
df = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                   'two' : pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                   'three' : pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [24]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [25]:
row = df.ix[1]  # or df.iloc[1]

In [44]:
row

one      0.580513
three   -1.818959
two     -0.744376
Name: b, dtype: float64

In [48]:
column = df['two'] # or df.loc[:,'two']

In [50]:
column

a   -1.060154
b   -0.744376
c   -1.752320
d   -0.799884
Name: two, dtype: float64

In [54]:
df.sub(row, axis = 'columns') # or df.sub(row, axis = 1)

        one     three       two
a -1.229021       NaN -0.315778
b  0.000000  0.000000  0.000000
c  0.354737  0.886103 -1.007944
d       NaN  2.696726 -0.055507

In [55]:
df.sub(column, axis='index') # or df.sub(column, axis=0)

        one     three  two
a  0.411647       NaN  0.0
b  1.324889 -1.074582  0.0
c  2.687570  0.819464  0.0
d       NaN  1.677651  0.0

Furthermore you can align a level of a multi-indexed DataFrame with a Series.

In [56]:
dfmi = df.copy()

In [57]:
dfmi.index = pd.MultiIndex.from_tuples([(1,'a'),(1,'b'),(1,'c'),(2,'a')],
                                       names=['first','second'])

In [58]:
dfmi

                   one     three       two
first second
1     a      -0.648508       NaN -1.060154
      b       0.580513 -1.818959 -0.744376
      c       0.935250 -0.932856 -1.752320
2     a            NaN  0.877767 -0.799884

In [59]:
dfmi.sub(column, axis=0, level='second')

                   one     three       two
first second
1     a       0.411647       NaN  0.000000
      b       1.324889 -1.074582  0.000000
      c       2.687570  0.819464  0.000000
2     a            NaN  1.937922  0.260271

### Missing data / operations with fill values

In Series and DataFrame (though not yet in Panel), the arithmetic functions have the option of inputting a fill_value, namely a value to substitute when at most one of the values at a location are missing. For example, when adding two DataFrame objects, you may wish to treat NaN as 0 unless both DataFrames are missing that value, in which case the result will be NaN (you can later replace NaN with some other value using fillna if you wish).

In [60]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [68]:
df2 = df.fillna(0).copy()

In [69]:
df2

        one     three       two
a -0.648508  0.000000 -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d  0.000000  0.877767 -0.799884

In [70]:
df + df2

        one     three       two
a -1.297016       NaN -2.120309
b  1.161027 -3.637917 -1.488752
c  1.870501 -1.865712 -3.504640
d       NaN  1.755535 -1.599767

In [71]:
df.add(df2, fill_value = 0)

        one     three       two
a -1.297016  0.000000 -2.120309
b  1.161027 -3.637917 -1.488752
c  1.870501 -1.865712 -3.504640
d  0.000000  1.755535 -1.599767

### Flexible Comparisons

Starting in v0.8, pandas introduced binary comparison methods eq, ne, lt, gt, le, and ge to Series and DataFrame whose behavior is analogous to the binary arithmetic operations described above:

In [73]:
df2.gt(df)

     one  three    two
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [74]:
df2.ne(df)

     one  three    two
a  False   True  False
b  False  False  False
c  False  False  False
d   True  False  False

These operations produce a pandas object the same type as the left-hand-side input that if of dtype bool. These boolean objects can be used in indexing operations, see [here](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-boolean)

### Boolean Reductions

You can apply the reductions: **empty**, **any()**, **all()**, and **bool()** to provide a way to summarize a boolean result.

In [81]:
(df > 0).all() #default is axis = "index" or 0

one      False
three    False
two      False
dtype: bool

In [82]:
(df > 0).any()

one       True
three     True
two      False
dtype: bool

You can reduce to a final boolean value.

In [83]:
(df > 0).any().any()

True

You can test if a pandas object is empty, via the **empty**
property.

In [84]:
df.empty

False

In [85]:
pd.DataFrame(columns = list('ABC')).empty

True

To evaluate single-element pandas objects in a boolean context, use the method **bool()**:

In [86]:
pd.Series([True]).bool()

True

In [87]:
pd.Series([False]).bool()

False

In [88]:
pd.DataFrame([[True]])

      0
0  True

In [90]:
pd.DataFrame([[True]]).bool()

True

In [91]:
pd.DataFrame([[False]]).bool()

False

Warning You might be tempted to do the following:
    >>> if df:
         ...

Or

    >>> df and df2

These both will raise as you are trying to compare multiple values.

    ValueError: The truth value of an array is ambiguous. Use a.empty, a.any() or a.all().

See [gotchas](http://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas-truth) for a more detailed discussion.

### Comparing if objects are equivalent

Often you may find there is more than one way to compute the same result. As a simple example, consider df+df and df*2. To test that these two computations produce the same result, given the tools shown above, you might imagine using (df+df == df*2).all(). But in fact, this expression is False:

In [92]:
df+df == df*2

     one  three   two
a   True  False  True
b   True   True  True
c   True   True  True
d  False   True  True

In [98]:
(df+df == df*2).all()

one      False
three    False
two       True
dtype: bool

Notice that the boolean DataFrame df+df == df*2 contains some False values! That is because NaNs do not compare as equals:

In [99]:
np.nan == np.nan

False

So, as of v0.13.1, NDFrames (such as Series, DataFrames, and Panels) have an equals() method for testing equality, with NaNs in corresponding locations treated as equal.

In [100]:
(df+df).equals(df*2)

True

Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [101]:
df1 = pd.DataFrame({'col':['foo', 0, np.nan]})

In [102]:
df2 = pd.DataFrame({'col':[np.nan, 0, 'foo']}, index=[2,1,0])

In [103]:
df1

   col
0  foo
1    0
2  NaN

In [104]:
df2

   col
2  NaN
1    0
0  foo

In [105]:
df1.equals(df2)

False

In [106]:
df1.equals(df2.sort_index())

True

### Comparing array-like objects

You can conveniently do element-wise comparisons when comparing a pandas data structure with a scalar value

In [107]:
pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [108]:
 pd.Index(['foo', 'bar', 'baz']) == 'foo'

array([ True, False, False], dtype=bool)

Pandas also handles element-wise comparisons between different array-like objects of the same length:

In [109]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [110]:
pd.Series(['foo', 'bar', 'baz']) == np.array(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

Trying to compare Index or Series objects of different lengths will raise a ValueError:

In [112]:
# pd.Series(['foo', 'bar', 'baz']) == pd.Series(['foo', 'bar'])
# ValueError: Series lengths must match to compare

Note that this is different from the numpy behavior where a comparison can be broadcast:

In [113]:
 np.array([1, 2, 3]) == np.array([2])

array([False,  True, False], dtype=bool)

or it can return False if broadcasting can not be done:

In [114]:
np.array([1, 2, 3]) == np.array([1, 2])

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning: elementwise == comparison failed; this will raise an error in the future.
  if __name__ == '__main__':

False

## Combining overlapping data sets

A problem occasionally arising is the combination of two similar data sets where values in one are preferred over the other. An example would be two data series representing a particular economic indicator where one is considered to be of “higher quality”. However, the lower quality series might extend further back in history or have more complete data coverage. As such, we would like to combine two DataFrame objects where missing values in one DataFrame are conditionally filled with like-labeled values from the other DataFrame. The function implementing this operation is **combine_first()**, which we illustrate:

In [115]:
df1 = pd.DataFrame({'A' : [1., np.nan, 3., 5., np.nan],
                    'B' : [np.nan, 2., 3., np.nan, 6.]})

In [116]:
df2 = pd.DataFrame({'A' : [5., 2., 4., np.nan, 3., 7.],
                    'B' : [np.nan, np.nan, 3., 4., 6., 8.]})

In [117]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [118]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [119]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

### General DataFrame Combine

The **combine_first()** method above calls the more general DataFrame method **combine()**. This method takes another DataFrame and a combiner function, aligns the input DataFrame and then passes the combiner function pairs of Series (i.e., columns whose names are the same).

So, for instance, to reproduce **combine_first()** as above:

In [120]:
combiner = lambda x, y: np.where(pd.isnull(x), y, x)

In [121]:
combiner

In [122]:
df1.combine(df2, combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

## Descriptive statistics

A large number of methods for computing descriptive statistics and other related operations on Series, DataFrame, and Panel. Most of these are aggregations (hence producing a lower-dimensional result) like **sum()**, **mean()**, and **quantile()**, but some of them, like **cumsum()** and **cumprod()**, produce an object of the same size. Generally speaking, these methods take an **axis** argument, just like ndarray.{sum, std, ...}, but the axis can be specified by name or integer:

* **Series**: no axis argument needed
* **DataFrame**: “index” (axis=0, default), “columns” (axis=1)
* **Panel**: “items” (axis=0), “major” (axis=1, default), “minor” (axis=2)

For example:

In [123]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [128]:
df.mean() #or df.mean(0)

one      0.289085
three   -0.624682
two     -1.089184
dtype: float64

In [132]:
df.mean(1) #or df.mean(axis = 1 or "columns")

a   -0.854331
b   -0.660940
c   -0.583309
d    0.038942
dtype: float64

All such methods have a skipna option signaling whether to exclude missing data (True by default):

In [134]:
df.sum(0, skipna = False)

one           NaN
three         NaN
two     -4.356734
dtype: float64

In [135]:
df.sum(axis=1, skipna=True)

a   -1.708662
b   -1.982821
c   -1.749926
d    0.077884
dtype: float64

Combined with the broadcasting / arithmetic behavior, one can describe various statistical procedures, like standardization (rendering data zero mean and standard deviation 1), very concisely:

In [136]:
ts_stand = (df - df.mean()) / df.std()

In [137]:
ts_stand

        one     three       two
a -1.128100       NaN  0.062694
b  0.350642 -0.868867  0.744683
c  0.777458 -0.224204 -1.432180
d       NaN  1.093071  0.624803

In [138]:
ts_stand.std()

one      1.0
three    1.0
two      1.0
dtype: float64

In [139]:
 xs_stand = df.sub(df.mean(1), axis=0).div(df.std(1), axis=0)

In [142]:
xs_stand.std(1)

a    1.0
b    1.0
c    1.0
d    1.0
dtype: float64

Note that methods like **cumsum()** and **cumprod()** preserve the location of NA values:

In [143]:
df.cumsum()

        one     three       two
a -0.648508       NaN -1.060154
b -0.067994 -1.818959 -1.804531
c  0.867256 -2.751814 -3.556851
d       NaN -1.874047 -4.356734

Here is a quick reference summary table of common functions. Each also takes an optional level parameter which applies only if the object has a [hierarchical index](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical).

<table border="1" class="docutils" align = "left">
<colgroup>
<col width="20%" />
<col width="80%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Function</th>
<th class="head">Description</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">count</span></tt></td>
<td>Number of non-null observations</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">sum</span></tt></td>
<td>Sum of values</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">mean</span></tt></td>
<td>Mean of values</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">mad</span></tt></td>
<td>Mean absolute deviation</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">median</span></tt></td>
<td>Arithmetic median of values</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">min</span></tt></td>
<td>Minimum</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">max</span></tt></td>
<td>Maximum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">mode</span></tt></td>
<td>Mode</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">abs</span></tt></td>
<td>Absolute Value</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">prod</span></tt></td>
<td>Product of values</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">std</span></tt></td>
<td>Bessel-corrected sample standard deviation</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">var</span></tt></td>
<td>Unbiased variance</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">sem</span></tt></td>
<td>Standard error of the mean</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">skew</span></tt></td>
<td>Sample skewness (3rd moment)</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">kurt</span></tt></td>
<td>Sample kurtosis (4th moment)</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">quantile</span></tt></td>
<td>Sample quantile (value at %)</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">cumsum</span></tt></td>
<td>Cumulative sum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">cumprod</span></tt></td>
<td>Cumulative product</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">cummax</span></tt></td>
<td>Cumulative maximum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">cummin</span></tt></td>
<td>Cumulative minimum</td>
</tr>
</tbody>
</table>

Note that by chance some NumPy methods, like mean, std, and sum, will exclude NAs on Series input by default:

In [144]:
np.mean(df['one'])

0.2890852514985352

In [145]:
np.mean(df['one'].values)

nan

Series also has a method **nunique()** which will return the number of unique non-null values:

In [146]:
series = pd.Series(np.random.randn(500))

In [147]:
series[20:500] = np.nan

In [148]:
series[10:20]  = 5

In [150]:
series.nunique()

11

### Summarizing data: describe

There is a convenient **describe()** function which computes a variety of summary statistics about a Series or the columns of a DataFrame (excluding NAs of course):

In [151]:
series = pd.Series(np.random.randn(1000))

In [152]:
series[::2] = np.nan

In [153]:
series.describe()

C:\Anaconda2\lib\site-packages\numpy\lib\function_base.py:3823: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

count    500.000000
mean       0.096293
std        1.038361
min       -2.584954
25%             NaN
50%             NaN
75%             NaN
max        3.161543
dtype: float64

In [154]:
 frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])

In [156]:
frame.ix[::2] = np.nan

In [157]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.091959   -0.003558    0.058276    0.056249   -0.023981
std      0.973767    1.010847    0.993963    0.933181    1.035500
min     -3.600023   -2.806886   -3.629092   -2.771273   -3.147375
25%           NaN         NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN         NaN
max      2.954986    2.426325    2.618350    2.583097    3.173197

You can select specific percentiles to include in the output:

By default, the median is always included.

For a non-numerical Series object, **describe()** will give a simple summary of the number of unique values and most frequently occurring values:

In [158]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

In [159]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

Note that on a mixed-type DataFrame object, describe() will restrict the summary to include only numerical columns or, if none are, only categorical columns:

In [160]:
frame = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No'], 'b': range(4)})

In [162]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

This behaviour can be controlled by providing a list of types as include/exclude arguments. The special value all can also be used:

In [163]:
frame.describe(include=['object'])

         a
count    4
unique   2
top     No
freq     2

In [164]:
 frame.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [165]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top      No       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

That feature relies on [select_dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-selectdtypes). Refer to there for details about accepted inputs.

### Index of Min/Max Values

The **idxmin()** and **idxmax()** functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values:

In [175]:
s1 = pd.Series(np.random.randn(5))

In [176]:
s1

0   -0.543725
1   -1.303089
2   -1.454813
3    0.527219
4    0.031134
dtype: float64

In [177]:
s1.idxmin(), s1.idxmax()

(2, 3)

In [178]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A','B','C'])

In [179]:
df1

          A         B         C
0  0.412822  1.297395  0.565581
1  0.411433 -0.803406 -0.466814
2 -0.825119 -0.619946 -0.908971
3 -0.757649  1.045385 -1.138001
4  0.751215  1.536153 -0.625996

In [180]:
df1.idxmin(axis=0)

A    2
B    1
C    3
dtype: int64

In [181]:
df1.idxmax(axis=1)

0    B
1    A
2    B
3    B
4    B
dtype: object

When there are multiple rows (or columns) matching the minimum or maximum value, **idxmin()** and **idxmax()** return the first matching index:

In [182]:
df3 = pd.DataFrame([2, 1, 1, 3, np.nan], columns=['A'], index=list('edcba'))

In [183]:
df3

     A
e  2.0
d  1.0
c  1.0
b  3.0
a  NaN

In [186]:
df3['A'].idxmin()

'd'

In [187]:
df3.idxmin()

A    d
dtype: object

**Note:** `idxmin` and `idxmax` are called `argmin` and `argmax` in NumPy.

### Value counts (histogramming) / Mode

The **value_counts()** Series method and top-level function computes a histogram of a 1D array of values. It can also be used as a function on regular arrays:

In [188]:
data = np.random.randint(0, 7, size=50)

In [189]:
data

array([2, 6, 4, 5, 6, 3, 0, 4, 0, 4, 4, 4, 0, 5, 5, 1, 3, 1, 5, 5, 2, 2, 0,
       6, 2, 5, 2, 1, 0, 1, 5, 6, 0, 2, 6, 3, 2, 0, 2, 6, 0, 3, 3, 6, 6, 4,
       5, 5, 2, 4])

In [190]:
s = pd.Series(data)

In [191]:
s.value_counts()

5    9
2    9
6    8
0    8
4    7
3    5
1    4
dtype: int64

In [192]:
pd.value_counts(data)

5    9
2    9
6    8
0    8
4    7
3    5
1    4
dtype: int64

Similarly, you can get the most frequently occurring value(s) (the mode) of the values in a Series or DataFrame:

In [193]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])

In [194]:
s5.mode()

0    3
1    7
dtype: int64

In [199]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
                    "B": np.random.randint(-10, 15, size=50)})

In [200]:
df5.mode()

   A  B
0  5 -3

### Discretization and quantiling

Continuous values can be discretized using the cut() (bins based on values) and qcut() (bins based on sample quantiles) functions:

In [201]:
arr = np.random.randn(20)

In [202]:
factor = pd.cut(arr, 4)

In [203]:
factor

[(0.617, 1.227], (0.00659, 0.617], (-1.216, -0.604], (-0.604, 0.00659], (-1.216, -0.604], ..., (0.617, 1.227], (-1.216, -0.604], (-0.604, 0.00659], (0.00659, 0.617], (0.00659, 0.617]]
Length: 20
Categories (4, object): [(-1.216, -0.604] < (-0.604, 0.00659] < (0.00659, 0.617] < (0.617, 1.227]]

In [204]:
factor = pd.cut(arr, [-5, -1, 0, 1, 5])

In [205]:
factor.value_counts()

(-5, -1]     1
(-1, 0]     11
(0, 1]       6
(1, 5]       2
dtype: int64

qcut() computes sample quantiles. For example, we could slice up some normally distributed data into equal-size quartiles like so:

In [206]:
arr = np.random.randn(30)

In [207]:
factor = pd.qcut(arr, [0, .25, .5, .75, 1])

In [208]:
factor

[(0.441, 1.765], (-0.72, -0.27], (-0.72, -0.27], (-0.27, 0.441], [-1.808, -0.72], ..., (0.441, 1.765], (0.441, 1.765], [-1.808, -0.72], [-1.808, -0.72], [-1.808, -0.72]]
Length: 30
Categories (4, object): [[-1.808, -0.72] < (-0.72, -0.27] < (-0.27, 0.441] < (0.441, 1.765]]

In [209]:
 pd.value_counts(factor)

(0.441, 1.765]     8
[-1.808, -0.72]    8
(-0.27, 0.441]     7
(-0.72, -0.27]     7
dtype: int64

We can also pass infinite values to define the bins:

In [211]:
arr = np.random.randn(20)

In [212]:
factor = pd.cut(arr, [-np.inf, 0, np.inf])

In [213]:
factor.value_counts()

(-inf, 0]     8
(0, inf]     12
dtype: int64

## Function applicaton

To apply your own or another library’s functions to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, row- or column-wise, or elementwise.

 1. [Tablewise Function Application:](http://pandas.pydata.org/pandas-docs/stable/basics.html#tablewise-function-application) **[pipe()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.pipe.html#pandas.DataFrame.pipe)**
 2. [Row or Column-wise Function Application:](http://pandas.pydata.org/pandas-docs/stable/basics.html#row-or-column-wise-function-application) **[apply()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.apply.html#pandas.DataFrame.apply)**
 3. [Elementwise function application:](http://pandas.pydata.org/pandas-docs/stable/basics.html#elementwise) **[applymap()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.applymap.html#pandas.DataFrame.applymap)**

### Tablewise Function Application

DataFrames and Series can of course just be passed into functions. However, if the function needs to be called in a chain, consider using the **pipe()** method. Compare the following

f, g, and h are functions taking and returning ``DataFrames``
    
    f(g(h(df), arg1=1), arg2=2, arg3=3)

with the equivalent

    (df.pipe(h)
       .pipe(g, arg1=1)
       .pipe(f, arg2=2, arg3=3)
    )

Pandas encourages the second style, which is known as method chaining. pipe makes it easy to use your own or another library’s functions in method chains, alongside pandas’ methods.

In the example above, the functions f, g, and h each expected the DataFrame as the first positional argument. What if the function you wish to apply takes its data as, say, the second argument? In this case, provide pipe with a tuple of (callable, data_keyword). .pipe will route the DataFrame to the argument specified in the tuple.

For example, we can fit a regression using statsmodels. Their API expects a formula first and a DataFrame as the second argument, data. We pass in the function, keyword pair (sm.poisson, 'data') to pipe:

In [214]:
import statsmodels.formula.api as sm

In [215]:
bb = pd.read_csv('data/baseball.csv', index_col='id')

In [224]:
# Doesn't work...not sure how to fix
"""
(bb.query('h > 0')
 .assign(ln_h = lambda df: np.log(df.h))
 .pipe((sm.poisson, 'data'), 'hr ~ ln_h + year + g + C(lg)')
 .fit()
 .summary()
 )
"""

"\n(bb.query('h > 0')\n .assign(ln_h = lambda df: np.log(df.h))\n .pipe((sm.poisson, 'data'), 'hr ~ ln_h + year + g + C(lg)')\n .fit()\n .summary()\n )\n"

The pipe method is inspired by unix pipes and more recently dplyr and magrittr, which have introduced the popular (%>%) (read pipe) operator for R. The implementation of pipe here is quite clean and feels right at home in python. We encourage you to view the source code (pd.DataFrame.pipe?? in IPython).

### Row or Column-wise Function Application

Arbitrary functions can be applied along the axes of a DataFrame or Panel using the **apply()** method, which, like the descriptive statistics methods, take an optional axis argument:

In [225]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [226]:
df.apply(np.mean)

one      0.289085
three   -0.624682
two     -1.089184
dtype: float64

In [227]:
df.apply(np.mean, axis=1)

a   -0.854331
b   -0.660940
c   -0.583309
d    0.038942
dtype: float64

In [228]:
df.apply(lambda x: x.max() - x.min())

one      1.583758
three    2.696726
two      1.007944
dtype: float64

In [229]:
df.apply(np.cumsum)

        one     three       two
a -0.648508       NaN -1.060154
b -0.067994 -1.818959 -1.804531
c  0.867256 -2.751814 -3.556851
d       NaN -1.874047 -4.356734

In [230]:
df.apply(np.exp)

        one     three       two
a  0.522825       NaN  0.346402
b  1.786955  0.162195  0.475031
c  2.547851  0.393429  0.173371
d       NaN  2.405523  0.449381

Depending on the return type of the function passed to **apply()**, the result will either be of lower dimension or the same dimension.

**apply()** combined with some cleverness can be used to answer many questions about a data set. For example, suppose we wanted to extract the date where the maximum value for each column occurred:

In [231]:
tsdf = pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'],
                    index=pd.date_range('1/1/2000', periods=1000))

In [233]:
tsdf.apply(lambda x: x.idxmax())

A   2002-06-29
B   2001-01-31
C   2001-02-19
dtype: datetime64[ns]

You may also pass additional arguments and keyword arguments to the **apply()** method. For instance, consider the following function you would like to apply:

In [234]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

You may then apply this function as follows:

In [235]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [241]:
df.apply(subtract_and_divide, args=(0,), divide=2)

        one     three       two
a -0.324254       NaN -0.530077
b  0.290257 -0.909479 -0.372188
c  0.467625 -0.466428 -0.876160
d       NaN  0.438884 -0.399942

In [242]:
df.apply(subtract_and_divide, args=(5,), divide=1)

        one     three       two
a -5.648508       NaN -6.060154
b -4.419487 -6.818959 -5.744376
c -4.064750 -5.932856 -6.752320
d       NaN -4.122233 -5.799884

Another useful feature is the ability to pass Series methods to carry out some Series operation on each column or row:

In [246]:
tsdf.loc['2000-01-04':'2000-01-07'] = np.nan

In [248]:
tsdf = tsdf.iloc[0:10]

In [249]:
tsdf

                   A         B         C
2000-01-01 -0.826373 -0.797725  0.091672
2000-01-02 -0.077055  0.259896  0.314722
2000-01-03 -0.065032 -1.438713 -2.292992
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08 -1.384821 -0.315854  0.054385
2000-01-09 -0.728192 -0.430682  1.567192
2000-01-10 -2.620100 -1.856958 -1.331801

In [250]:
tsdf.apply(pd.Series.interpolate)

                   A         B         C
2000-01-01 -0.826373 -0.797725  0.091672
2000-01-02 -0.077055  0.259896  0.314722
2000-01-03 -0.065032 -1.438713 -2.292992
2000-01-04 -0.328990 -1.214141 -1.823517
2000-01-05 -0.592948 -0.989569 -1.354041
2000-01-06 -0.856906 -0.764997 -0.884566
2000-01-07 -1.120864 -0.540426 -0.415091
2000-01-08 -1.384821 -0.315854  0.054385
2000-01-09 -0.728192 -0.430682  1.567192
2000-01-10 -2.620100 -1.856958 -1.331801

Finally, **apply()** takes an argument raw which is False by default, which converts each row or column into a Series before applying the function. When set to True, the passed function will instead receive an ndarray object, which has positive performance implications if you do not need the indexing functionality.

**See also:** The section on [GroupBy](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby) demonstrates related, flexible functionality for grouping by some criterion, applying, and combining the results into a Series, DataFrame, etc.

### Applying elementwise Python  functions

Since not all functions can be vectorized (accept NumPy arrays and return another array or value), the methods **applymap()** on DataFrame and analogously **map()** on Series accept any Python function taking a single value and returning a single value. For example:

In [258]:
df4 = df.copy()

In [259]:
df4

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [260]:
f = lambda x: len(str(x))

In [261]:
df4['one'].map(f)

a    15
b    14
c    14
d     3
Name: one, dtype: int64

In [262]:
df4.applymap(f)

   one  three  two
a   15      3   14
b   14     14   15
c   14     15   14
d    3     14   15

**Series.map()** has an additional feature which is that it can be used to easily “link” or “map” values defined by a secondary series. This is closely related to [merging/joining functionality](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging):

In [263]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],
              index=['a', 'b', 'c', 'd', 'e'])

In [264]:
t = pd.Series({'six' : 6., 'seven' : 7.})

In [265]:
s

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [266]:
t

seven    7.0
six      6.0
dtype: float64

In [267]:
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

### Applying with a Panel

Applying with a Panel will pass a Series to the applied function. If the applied function returns a Series, the result of the application will be a Panel. If the applied function reduces to a scalar, the result of the application will be a DataFrame.

**Note:** Prior to 0.13.1 apply on a Panel would only work on ufuncs (e.g. np.sum/np.max).

In [268]:
import pandas.util.testing as tm

In [269]:
panel = tm.makePanel(5)

In [270]:
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 5 (major_axis) x 4 (minor_axis)
Items axis: ItemA to ItemC
Major_axis axis: 2000-01-03 00:00:00 to 2000-01-07 00:00:00
Minor_axis axis: A to D

In [271]:
panel['ItemA']

                   A         B         C         D
2000-01-03  0.423400  1.319777  0.984601  0.786756
2000-01-04 -0.964339 -0.852524  0.658022 -1.569861
2000-01-05 -1.423748  0.818447  2.104680 -1.700514
2000-01-06 -0.371473 -0.214182  0.056136  0.038166
2000-01-07  0.731295  1.857414  0.055033  1.851630

A transformational apply.

In [272]:
result = panel.apply(lambda x: x*2, axis='items')

In [273]:
result

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 5 (major_axis) x 4 (minor_axis)
Items axis: ItemA to ItemC
Major_axis axis: 2000-01-03 00:00:00 to 2000-01-07 00:00:00
Minor_axis axis: A to D

In [274]:
result['ItemA']

                   A         B         C         D
2000-01-03  0.846800  2.639555  1.969203  1.573513
2000-01-04 -1.928677 -1.705049  1.316043 -3.139722
2000-01-05 -2.847497  1.636895  4.209360 -3.401029
2000-01-06 -0.742946 -0.428365  0.112273  0.076333
2000-01-07  1.462590  3.714829  0.110067  3.703260

A reduction operation.

In [275]:
panel.apply(lambda x: x.dtype, axis='items')

                  A        B        C        D
2000-01-03  float64  float64  float64  float64
2000-01-04  float64  float64  float64  float64
2000-01-05  float64  float64  float64  float64
2000-01-06  float64  float64  float64  float64
2000-01-07  float64  float64  float64  float64

A similar reduction type operation

In [276]:
panel.apply(lambda x: x.sum(), axis='major_axis')

      ItemA     ItemB     ItemC
A -1.604865 -2.079969  2.066802
B  2.928932  0.784355 -0.273076
C  3.858473  1.079016  2.652317
D -0.593823 -0.130808 -0.283707

This last reduction is equivalent to

In [277]:
panel.sum('major_axis')

      ItemA     ItemB     ItemC
A -1.604865 -2.079969  2.066802
B  2.928932  0.784355 -0.273076
C  3.858473  1.079016  2.652317
D -0.593823 -0.130808 -0.283707

A transformation operation that returns a Panel, but is computing the z-score across the major_axis.

In [278]:
result = panel.apply(
    lambda x: (x-x.mean())/x.std(),
    axis='major_axis')

In [279]:
result

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 5 (major_axis) x 4 (minor_axis)
Items axis: ItemA to ItemC
Major_axis axis: 2000-01-03 00:00:00 to 2000-01-07 00:00:00
Minor_axis axis: A to D

In [280]:
result['ItemA']

                   A         B         C         D
2000-01-03  0.820281  0.661912  0.251757  0.592760
2000-01-04 -0.708973 -1.297066 -0.134415 -0.949898
2000-01-05 -1.215232  0.209813  1.576221 -1.035425
2000-01-06 -0.055650 -0.721410 -0.846129  0.102728
2000-01-07  1.159574  1.146751 -0.847434  1.289834

Apply can also accept multiple axes in the axis argument. This will pass a DataFrame of the cross-section to the applied function.

In [281]:
f = lambda x: ((x.T-x.mean(1))/x.std(1)).T

In [282]:
result = panel.apply(f, axis = ['items','major_axis'])

In [283]:
result

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 5 (major_axis) x 3 (minor_axis)
Items axis: A to D
Major_axis axis: 2000-01-03 00:00:00 to 2000-01-07 00:00:00
Minor_axis axis: ItemA to ItemC

In [285]:
result.loc[:,:,'ItemA']

                   A         B         C         D
2000-01-03  0.170102  1.137731  0.882365  0.943867
2000-01-04 -0.910008 -1.107344 -0.468222 -0.681336
2000-01-05 -0.939701 -0.585970  1.122760 -0.908065
2000-01-06  0.356126 -1.102907 -0.578516  0.332407
2000-01-07  0.673951  1.075835 -0.506175  1.105989

This is equivalent to the following

In [286]:
result = pd.Panel(dict([ (ax, f(panel.loc[:,:,ax]))
                  for ax in panel.minor_axis ]))

In [287]:
result

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 5 (major_axis) x 3 (minor_axis)
Items axis: A to D
Major_axis axis: 2000-01-03 00:00:00 to 2000-01-07 00:00:00
Minor_axis axis: ItemA to ItemC

In [288]:
result.loc[:,:,'ItemA']

                   A         B         C         D
2000-01-03  0.170102  1.137731  0.882365  0.943867
2000-01-04 -0.910008 -1.107344 -0.468222 -0.681336
2000-01-05 -0.939701 -0.585970  1.122760 -0.908065
2000-01-06  0.356126 -1.102907 -0.578516  0.332407
2000-01-07  0.673951  1.075835 -0.506175  1.105989

## Reindexing and altering labels

**reindex()** is the fundamental data alignment method in pandas. It is used to implement nearly all other features relying on label-alignment functionality. To reindex means to conform the data to match a given set of labels along a particular axis. This accomplishes several things:

* Reorders the existing data to match a new set of labels
* Inserts missing value (NA) markers in label locations where no data for that label existed
* If specified, **fill** data for missing labels using logic (highly relevant to working with time series data)

Here is a simple example:

In [289]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [290]:
s

a   -1.463969
b   -2.022841
c   -1.637103
d    0.005063
e    0.097862
dtype: float64

In [291]:
s.reindex(['e', 'b', 'f', 'd'])

e    0.097862
b   -2.022841
f         NaN
d    0.005063
dtype: float64

Here, the f label was not contained in the Series and hence appears as NaN in the result.

With a DataFrame, you can simultaneously reindex the index and columns:

In [292]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [293]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c -0.932856 -1.752320  0.935250
f       NaN       NaN       NaN
b -1.818959 -0.744376  0.580513

For convenience, you may utilize the **reindex_axis()** method, which takes the labels and a keyword axis parameter.

Note that the Index objects containing the actual axis labels can be **shared** between objects. So if we have a Series and a DataFrame, the following can be done:

In [294]:
s

a   -1.463969
b   -2.022841
c   -1.637103
d    0.005063
e    0.097862
dtype: float64

In [295]:
df.index

Index([u'a', u'b', u'c', u'd'], dtype='object')

In [296]:
rs = s.reindex(df.index)

In [297]:
rs.index is df.index

True

This means that the reindexed Series’s index is the same Python object as the DataFrame’s index.

**See also:** [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced) is an even more concise way of doing reindexing.

**Note:** When writing performance-sensitive code, there is a good reason to spend some time becoming a reindexing ninja: **many operations are faster on pre-aligned data.** Adding two unaligned DataFrames internally triggers a reindexing step. For exploratory analysis you will hardly notice the difference (because reindex has been heavily optimized), but when CPU cycles matter sprinkling a few explicit reindex calls here and there can have an impact.

### Reindexing to align with another object

You may wish to take an object and reindex its axes to be labeled the same as another object. While the syntax for this is straightforward albeit verbose, it is a common enough operation that the **reindex_like()** method is available to make this simpler:

In [303]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [307]:
df2 = df[0:3].copy()

In [308]:
df2

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320

In [309]:
df.reindex_like(df2)

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320

### Aligning objects with each other with align

The align() method is the fastest way to simultaneously align two objects. It supports a join argument (related to [joining and merging)](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging):

* `join='outer'`: take the union of the indexes (default)
* `join='left'`: use the calling object’s index
* `join='right'`: use the passed object’s index
* `join='inner'`: intersect the indexes

It returns a tuple with both of the reindexed Series:

In [310]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [311]:
s

a    0.315921
b    0.096587
c   -1.466747
d   -2.207584
e    0.643140
dtype: float64

In [312]:
s1 = s[:4]

In [313]:
s2 = s[1:]

In [314]:
s1

a    0.315921
b    0.096587
c   -1.466747
d   -2.207584
dtype: float64

In [315]:
s2

b    0.096587
c   -1.466747
d   -2.207584
e    0.643140
dtype: float64

In [316]:
s1.align(s2)

(a    0.315921
 b    0.096587
 c   -1.466747
 d   -2.207584
 e         NaN
 dtype: float64, a         NaN
 b    0.096587
 c   -1.466747
 d   -2.207584
 e    0.643140
 dtype: float64)

In [317]:
s1.align(s2, join='inner')

(b    0.096587
 c   -1.466747
 d   -2.207584
 dtype: float64, b    0.096587
 c   -1.466747
 d   -2.207584
 dtype: float64)

In [318]:
s1.align(s2, join='left')

(a    0.315921
 b    0.096587
 c   -1.466747
 d   -2.207584
 dtype: float64, a         NaN
 b    0.096587
 c   -1.466747
 d   -2.207584
 dtype: float64)

For DataFrames, the join method will be applied to both the index and the columns by default:

In [319]:
df.align(df2, join='inner')

(        one     three       two
 a -0.648508       NaN -1.060154
 b  0.580513 -1.818959 -0.744376
 c  0.935250 -0.932856 -1.752320,         one     three       two
 a -0.648508       NaN -1.060154
 b  0.580513 -1.818959 -0.744376
 c  0.935250 -0.932856 -1.752320)

You can also pass an axis option to only align on the specified axis:

In [322]:
 df.align(df2, join='inner', axis=0)

(        one     three       two
 a -0.648508       NaN -1.060154
 b  0.580513 -1.818959 -0.744376
 c  0.935250 -0.932856 -1.752320,         one     three       two
 a -0.648508       NaN -1.060154
 b  0.580513 -1.818959 -0.744376
 c  0.935250 -0.932856 -1.752320)

If you pass a Series to **DataFrame.align()**, you can choose to align both objects either on the DataFrame’s index or columns using the axis argument:

In [324]:
df.align(df2.ix[0], axis=1)

(        one     three       two
 a -0.648508       NaN -1.060154
 b  0.580513 -1.818959 -0.744376
 c  0.935250 -0.932856 -1.752320
 d       NaN  0.877767 -0.799884, one     -0.648508
 three         NaN
 two     -1.060154
 Name: a, dtype: float64)

### Filling while reindexing

**reindex()** takes an optional parameter method which is a filling method chosen from the following table:

<table border="1" class="docutils" align = "left">
<colgroup>
<col width="38%" />
<col width="63%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Method</th>
<th class="head">Action</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>pad / ffill</td>
<td>Fill values forward</td>
</tr>
<tr class="row-odd"><td>bfill / backfill</td>
<td>Fill values backward</td>
</tr>
<tr class="row-even"><td>nearest</td>
<td>Fill from the nearest index value</td>
</tr>
</tbody>
</table>

We illustrate these fill methods on a simple Series:

In [325]:
rng = pd.date_range('1/3/2000', periods=8)

In [326]:
ts = pd.Series(np.random.randn(8), index=rng)

In [328]:
ts2 = ts[[0, 3, 6]]

In [329]:
ts

2000-01-03   -1.289331
2000-01-04   -0.222518
2000-01-05   -0.471495
2000-01-06   -0.359290
2000-01-07    0.692203
2000-01-08    1.241683
2000-01-09    0.062904
2000-01-10   -1.059759
Freq: D, dtype: float64

In [330]:
ts2

2000-01-03   -1.289331
2000-01-06   -0.359290
2000-01-09    0.062904
dtype: float64

In [331]:
ts2.reindex(ts.index)

2000-01-03   -1.289331
2000-01-04         NaN
2000-01-05         NaN
2000-01-06   -0.359290
2000-01-07         NaN
2000-01-08         NaN
2000-01-09    0.062904
2000-01-10         NaN
Freq: D, dtype: float64

In [332]:
ts2.reindex(ts.index, method='ffill')

2000-01-03   -1.289331
2000-01-04   -1.289331
2000-01-05   -1.289331
2000-01-06   -0.359290
2000-01-07   -0.359290
2000-01-08   -0.359290
2000-01-09    0.062904
2000-01-10    0.062904
Freq: D, dtype: float64

In [333]:
ts2.reindex(ts.index, method='bfill')

2000-01-03   -1.289331
2000-01-04   -0.359290
2000-01-05   -0.359290
2000-01-06   -0.359290
2000-01-07    0.062904
2000-01-08    0.062904
2000-01-09    0.062904
2000-01-10         NaN
Freq: D, dtype: float64

In [334]:
ts2.reindex(ts.index, method='nearest')

2000-01-03   -1.289331
2000-01-04   -1.289331
2000-01-05   -0.359290
2000-01-06   -0.359290
2000-01-07   -0.359290
2000-01-08    0.062904
2000-01-09    0.062904
2000-01-10    0.062904
Freq: D, dtype: float64

These methods require that the indexes are **ordered** increasing or decreasing.

Note that the same result could have been achieved using [fillna](http://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data-fillna) (except for method='nearest') or [interpolate](http://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data-interpolate):

In [335]:
ts2.reindex(ts.index).fillna(method='ffill')

2000-01-03   -1.289331
2000-01-04   -1.289331
2000-01-05   -1.289331
2000-01-06   -0.359290
2000-01-07   -0.359290
2000-01-08   -0.359290
2000-01-09    0.062904
2000-01-10    0.062904
Freq: D, dtype: float64

**reindex()** will raise a ValueError if the index is not monotonic increasing or decreasing. **fillna()** and **interpolate()** will not make any checks on the order of the index.

### Limits on filling while reindexing

The limit and tolerance arguments provide additional control over filling while reindexing. Limit specifies the maximum count of consecutive matches:

In [336]:
ts2.reindex(ts.index, method='ffill', limit=1)

2000-01-03   -1.289331
2000-01-04   -1.289331
2000-01-05         NaN
2000-01-06   -0.359290
2000-01-07   -0.359290
2000-01-08         NaN
2000-01-09    0.062904
2000-01-10    0.062904
Freq: D, dtype: float64

In contrast, tolerance specifies the maximum distance between the index and indexer values:

In [337]:
ts2.reindex(ts.index, method='ffill', tolerance='1 day')

2000-01-03   -1.289331
2000-01-04   -1.289331
2000-01-05         NaN
2000-01-06   -0.359290
2000-01-07   -0.359290
2000-01-08         NaN
2000-01-09    0.062904
2000-01-10    0.062904
Freq: D, dtype: float64

Notice that when used on a DatetimeIndex, TimedeltaIndex or PeriodIndex, tolerance will coerced into a Timedelta if possible. This allows you to specify tolerance with appropriate strings.

### Dropping labels from an axis

A method closely related to reindex is the drop() function. It removes a set of labels from an axis:

In [338]:
df

        one     three       two
a -0.648508       NaN -1.060154
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320
d       NaN  0.877767 -0.799884

In [339]:
df.drop(['a', 'd'], axis=0)

        one     three       two
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320

In [340]:
df.drop(['one'], axis=1)

      three       two
a       NaN -1.060154
b -1.818959 -0.744376
c -0.932856 -1.752320
d  0.877767 -0.799884

Note that the following also works, but is a bit less obvious / clean:

In [341]:
df.reindex(df.index.difference(['a', 'd']))

        one     three       two
b  0.580513 -1.818959 -0.744376
c  0.935250 -0.932856 -1.752320

### Renaming / mapping labels

The **rename()** method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [342]:
s

a    0.315921
b    0.096587
c   -1.466747
d   -2.207584
e    0.643140
dtype: float64

In [343]:
s.rename(str.upper)

A    0.315921
B    0.096587
C   -1.466747
D   -2.207584
E    0.643140
dtype: float64

If you pass a function, it must return a value when called with any of the labels (and must produce a set of unique values). But if you pass a dict or Series, it need only contain a subset of the labels as keys:

In [344]:
df.rename(columns={'one' : 'foo', 'two' : 'bar'},
      index={'a' : 'apple', 'b' : 'banana', 'd' : 'durian'})

             foo     three       bar
apple  -0.648508       NaN -1.060154
banana  0.580513 -1.818959 -0.744376
c       0.935250 -0.932856 -1.752320
durian       NaN  0.877767 -0.799884

The **rename()** method also provides an inplace named parameter that is by default False and copies the underlying data. Pass inplace=True to rename the data in place.

New in version 0.18.0.

Finally, **rename()** also accepts a scalar or list-like for altering the Series.name attribute.

In [345]:
s.rename("scalar-name")

a    0.315921
b    0.096587
c   -1.466747
d   -2.207584
e    0.643140
Name: scalar-name, dtype: float64

The Panel class has a related **rename_axis()** class which can rename any of its three axes.

## Iteration

The behavior of basic iteration over pandas objects depends on the type. When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. Other data structures, like DataFrame and Panel, follow the dict-like convention of iterating over the “keys” of the objects.

In short, basic iteration (for i in object) produces:

* **Series:** values
* **DataFrame:** column labels
* **Panel:** item labels

Thus, for example, iterating over a DataFrame gives you the column names:

In [346]:
df = pd.DataFrame({'col1' : np.random.randn(3), 'col2' : np.random.randn(3)},
                  index=['a', 'b', 'c'])

In [347]:
for col in df:
    print(col)

col1
col2

Pandas objects also have the dict-like iteritems() method to iterate over the (key, value) pairs.

To iterate over the rows of a DataFrame, you can use the following methods:

* **iterrows():** Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.
* **itertuples():** Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than iterrows(), and is in most cases preferable to use to iterate over the values of a DataFrame.

**Warning:** Iterating through pandas objects is generally slow. In many cases, iterating manually over the rows is not needed and can be avoided with one of the following approaches:
Look for a vectorized solution: many operations can be performed using built-in methods or numpy functions, (boolean) indexing, ...
When you have a function that cannot work on the full DataFrame/Series at once, it is better to use apply() instead of iterating over the values. See the docs on function application.
If you need to do iterative manipulations on the values but performance is important, consider writing the inner loop using e.g. cython or numba. See the enhancing performance section for some examples of this approach.

**Warning:** You should never modify something you are iterating over. This is not guaranteed to work in all cases. Depending on the data types, the iterator returns a copy and not a view, and writing to it will have no effect!
For example, in the following case setting the value has no effect:

In [348]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})

In [349]:
for index, row in df.iterrows():
    row['a'] = 10

In [350]:
df

   a  b
0  1  a
1  2  b
2  3  c

### iteritems

Consistent with the dict-like interface, **iteritems()** iterates through key-value pairs:

* **Series:** (index, scalar value) pairs
* **DataFrame:** (column, Series) pairs
* **Panel:** (item, DataFrame) pairs

For example:

In [352]:
for item, frame in wp.iteritems():
    print(item)
    print(frame)

Item1
                   A         B         C         D
2000-01-01  1.841800 -2.145367  0.370944  0.041665
2000-01-02  1.147747  0.446823 -0.841678 -1.047763
2000-01-03 -0.058012  0.593976 -0.172701 -0.322282
2000-01-04  0.160701 -0.406863  0.859470  0.067646
2000-01-05  1.270331 -2.623177 -0.197294 -0.547791
Item2
                   A         B         C         D
2000-01-01  0.210865 -0.346281  0.168871  0.659295
2000-01-02  0.490313 -0.077933 -0.568516 -1.753095
2000-01-03 -0.199439  2.605886  0.278318  0.368171
2000-01-04 -1.594580  0.631966 -0.424964  0.971190
2000-01-05 -0.053151  1.113250  0.202868  1.311148

### iterrows

**iterrows()** allows you to iterate through the rows of a DataFrame as Series objects. It returns an iterator yielding each index value along with a Series containing the data in each row:

In [355]:
df

   a  b
0  1  a
1  2  b
2  3  c

In [354]:
for row_index, row in df.iterrows():
    print row_index
    print row

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

**Note:** Because iterrows() returns a Series for each row, it does **not** preserve dtypes across the rows (dtypes are preserved across columns for DataFrames). For example,

In [356]:
df_orig = pd.DataFrame([[1, 1.5]], columns=['int', 'float'])

In [361]:
df_orig

   int  float
0    1    1.5

In [357]:
df_orig.dtypes

int        int64
float    float64
dtype: object

In [358]:
row = next(df_orig.iterrows())[1]

In [360]:
row

int      1.0
float    1.5
Name: 0, dtype: float64

All values in row, returned as a Series, are now upcasted to floats, also the original integer value in column x:

In [362]:
row['int'].dtype

dtype('float64')

In [363]:
df_orig['int'].dtype

dtype('int64')

To preserve dtypes while iterating over the rows, it is better to use **itertuples()** which returns namedtuples of the values and which is generally much faster as iterrows.

For instance, a contrived way to transpose the DataFrame would be:

In [364]:
df2 = pd.DataFrame({'x': [1, 2, 3], 'y': [4, 5, 6]})

In [365]:
df2

   x  y
0  1  4
1  2  5
2  3  6

In [366]:
df2.T

   0  1  2
x  1  2  3
y  4  5  6

In [367]:
df2_t = pd.DataFrame(dict((idx,values) for idx, values in df2.iterrows()))

In [368]:
df2_t

   0  1  2
x  1  2  3
y  4  5  6

### itertuples

The **itertuples()** method will return an iterator yielding a namedtuple for each row in the DataFrame. The first element of the tuple will be the row’s corresponding index value, while the remaining values are the row values.

For instance,

In [369]:
for row in df.itertuples():
    print row

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')

This method does not convert the row to a Series object but just returns the values inside a namedtuple. Therefore, **itertuples()** preserves the data type of the values and is generally faster as **iterrows()**.

**Note:** The column names will be renamed to positional names if they are invalid Python identifiers, repeated, or start with an underscore. With a large number of columns (>255), regular tuples are returned.

## .dt accessor

Series has an accessor to succinctly return datetime like properties for the values of the Series, if it is a datetime/period like Series. This will return a Series, indexed like the existing Series.

In [370]:
# datetime
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [371]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [372]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [373]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [374]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

This enables nice expressions like this:

In [375]:
s[s.dt.day==2]

1   2013-01-02 09:10:12
dtype: datetime64[ns]

You can easily produces tz aware transformations:

In [376]:
stz = s.dt.tz_localize('US/Eastern')

In [377]:
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [378]:
stz.dt.tz

You can also chain these types of operations:

You can also format datetime values as strings with **Series.dt.strftime()** which supports the same format as the standard **strftime()**.

In [379]:
# DatetimeIndex
s = pd.Series(pd.date_range('20130101', periods=4))

In [380]:
s

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
dtype: datetime64[ns]

In [381]:
s.dt.strftime('%Y/%m/%d')

0    2013/01/01
1    2013/01/02
2    2013/01/03
3    2013/01/04
dtype: object

In [382]:
# PeriodIndex
s = pd.Series(pd.period_range('20130101', periods=4))

In [383]:
s

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
dtype: object

In [384]:
s.dt.strftime('%Y/%m/%d')

0    2013/01/01
1    2013/01/02
2    2013/01/03
3    2013/01/04
dtype: object

The .dt accessor works for period and timedelta dtypes.

In [385]:
# period
s = pd.Series(pd.period_range('20130101', periods=4, freq='D'))

In [386]:
s.dt.year

0    2013
1    2013
2    2013
3    2013
dtype: int64

In [387]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [388]:
# timedelta
s = pd.Series(pd.timedelta_range('1 day 00:00:05', periods=4, freq='s'))

In [389]:
s.dt.days

0    1
1    1
2    1
3    1
dtype: int64

In [390]:
s.dt.seconds

0    5
1    6
2    7
3    8
dtype: int64

In [391]:
s.dt.components

   days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0     1      0        0        5             0             0            0
1     1      0        0        6             0             0            0
2     1      0        0        7             0             0            0
3     1      0        0        8             0             0            0

**Note:** Series.dt will raise a TypeError if you access with a non-datetimelike values

## Vecorized string methods

Series is equipped with a set of string processing methods that make it easy to operate on each element of the array. Perhaps most importantly, these methods exclude missing/NA values automatically. These are accessed via the Series’s str attribute and generally have names matching the equivalent (scalar) built-in string methods. For example:

In [392]:
 s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [393]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Powerful pattern-matching methods are provided as well, but note that pattern-matching generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them).

Please see [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods) for a complete description.

## Sorting

There are two obvious kinds of sorting that you may be interested in: sorting by label and sorting by actual values.

### By Index

The primary method for sorting axis labels (indexes) are the Series.sort_index() and the DataFrame.sort_index() methods.

In [394]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                  columns=['three', 'two', 'one'])

In [395]:
unsorted_df

   three  two  one
a    NaN  NaN  NaN
d    NaN  NaN  NaN
c    NaN  NaN  NaN
b    NaN  NaN  NaN

In [396]:
# DataFrame
unsorted_df.sort_index()

   three  two  one
a    NaN  NaN  NaN
b    NaN  NaN  NaN
c    NaN  NaN  NaN
d    NaN  NaN  NaN

In [397]:
 unsorted_df.sort_index(ascending=False)

   three  two  one
d    NaN  NaN  NaN
c    NaN  NaN  NaN
b    NaN  NaN  NaN
a    NaN  NaN  NaN

In [398]:
unsorted_df.sort_index(axis=1)

   one  three  two
a  NaN    NaN  NaN
d  NaN    NaN  NaN
c  NaN    NaN  NaN
b  NaN    NaN  NaN

In [400]:
# Series
unsorted_df['three'].sort_index()

a   NaN
b   NaN
c   NaN
d   NaN
Name: three, dtype: float64

### By Values

The **Series.sort_values()** and **DataFrame.sort_values()** are the entry points for **value** sorting (that is the values in a column or row). **DataFrame.sort_values()** can accept an optional by argument for axis=0 which will use an arbitrary vector or a column name of the DataFrame to determine the sort order:

In [401]:
df1 = pd.DataFrame({'one':[2,1,1,1],'two':[1,3,2,4],'three':[5,4,3,2]})

In [402]:
df1

   one  three  two
0    2      5    1
1    1      4    3
2    1      3    2
3    1      2    4

In [403]:
df1.sort_values(by='two')

   one  three  two
0    2      5    1
2    1      3    2
1    1      4    3
3    1      2    4

The by argument can take a list of column names, e.g.:

In [404]:
df1[['one', 'two', 'three']].sort_values(by=['one','two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

These methods have special treatment of NA values via the na_position argument:

In [405]:
s[2] = np.nan

In [406]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2     NaN
5     NaN
dtype: object

In [407]:
s.sort_values(na_position='first')

2     NaN
5     NaN
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: object

### searchsorted

Series has the **searchsorted()** method, which works similar to **numpy.ndarray.searchsorted()**.

In [408]:
ser = pd.Series([1, 2, 3])

In [409]:
ser.searchsorted([0, 3])

array([0, 2], dtype=int64)

In [410]:
ser.searchsorted([0, 4])

array([0, 3], dtype=int64)

In [411]:
ser.searchsorted([1, 3], side='right')

array([1, 3], dtype=int64)

In [412]:
ser.searchsorted([1, 3], side='left')

array([0, 2], dtype=int64)

In [413]:
ser = pd.Series([3, 1, 2])

In [414]:
ser.searchsorted([0, 3], sorter=np.argsort(ser))

array([0, 2], dtype=int64)

### smallest / largest values

New in version 0.14.0.

Series has the **nsmallest()** and **nlargest()** methods which return the smallest or largest n values. For a large Series this can be much faster than sorting the entire Series and calling head(n) on the result.

In [415]:
s = pd.Series(np.random.permutation(10))

In [416]:
s

0    5
1    4
2    8
3    7
4    3
5    6
6    9
7    1
8    0
9    2
dtype: int32

In [417]:
s.sort_values()

8    0
7    1
9    2
4    3
1    4
0    5
5    6
3    7
2    8
6    9
dtype: int32

In [418]:
s.nsmallest(3)

8    0
7    1
9    2
dtype: int32

In [419]:
s.nlargest(3)

6    9
2    8
3    7
dtype: int32

New in version 0.17.0.

DataFrame also has the nlargest and nsmallest methods.

In [420]:
df = pd.DataFrame({'a': [-2, -1, 1, 10, 8, 11, -1],
                   'b': list('abdceff'),
                   'c': [1.0, 2.0, 4.0, 3.2, np.nan, 3.0, 4.0]})

In [421]:
df.nlargest(3, 'a')

    a  b    c
5  11  f  3.0
3  10  c  3.2
4   8  e  NaN

In [422]:
df.nlargest(5, ['a', 'c'])

    a  b    c
5  11  f  3.0
3  10  c  3.2
4   8  e  NaN
2   1  d  4.0
1  -1  b  2.0

In [423]:
df.nsmallest(3, 'a')

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0

In [424]:
df.nsmallest(5, ['a', 'c'])

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0
2  1  d  4.0
4  8  e  NaN

### Sorting by a multi-index column

You must be explicit about sorting when the column is a multi-index, and fully specify all levels to by.

In [425]:
df1.columns = pd.MultiIndex.from_tuples([('a','one'),('a','two'),('b','three')])

In [426]:
df1

    a         b
  one two three
0   2   5     1
1   1   4     3
2   1   3     2
3   1   2     4

In [427]:
df1.sort_values(by=('a','two'))

    a         b
  one two three
3   1   2     4
2   1   3     2
1   1   4     3
0   2   5     1

## Copying

The **copy()** method on pandas objects copies the underlying data (though not the axis indexes, since they are immutable) and returns a new object. Note that **it is seldom necessary to copy objects.** For example, there are only a handful of ways to alter a DataFrame in-place:

* Inserting, deleting, or modifying a column
* Assigning to the index or columns attributes
* For homogeneous data, directly modifying the values via the values attribute or advanced indexing

To be clear, no pandas methods have the side effect of modifying your data; almost all methods return new objects, leaving the original object untouched. If data is modified, it is because you did so explicitly.

## dtypes

The main types stored in pandas objects are float, int, bool, datetime64[ns] and datetime64[ns, tz] (in >= 0.17.0), timedelta[ns], category (in >= 0.15.0), and object. In addition these dtypes have item sizes, e.g. int64 and int32. See Series with TZ for more detail on datetime64[ns, tz] dtypes.

A convenient **dtypes** attribute for DataFrames returns a Series with the data type of each column.

In [428]:
dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                        F = False,
                        G = pd.Series([1]*3,dtype='int8')))

In [429]:
dft

          A  B    C          D    E      F  G
0  0.568296  1  foo 2001-01-02  1.0  False  1
1  0.459525  1  foo 2001-01-02  1.0  False  1
2  0.258342  1  foo 2001-01-02  1.0  False  1

In [430]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

On a Series use the **dtype** attribute.

In [431]:
dft['A'].dtype

dtype('float64')

If a pandas object contains data multiple dtypes IN A SINGLE COLUMN, the dtype of the column will be chosen to accommodate all of the data types (object is the most general).

In [432]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [433]:

# string data forces an ``object`` dtype
pd.Series([1, 2, 3, 6., 'foo'])

0      1
1      2
2      3
3      6
4    foo
dtype: object

The method **get_dtype_counts()** will return the number of columns of each type in a DataFrame:

In [434]:
dft.get_dtype_counts()

bool              1
datetime64[ns]    1
float32           1
float64           1
int64             1
int8              1
object            1
dtype: int64

Numeric dtypes will propagate and can coexist in DataFrames (starting in v0.11.0). If a dtype is passed (either directly via the dtype keyword, a passed ndarray, or a passed Series, then it will be preserved in DataFrame operations. Furthermore, different numeric dtypes will **NOT** be combined. The following example will give you a taste

In [435]:
df1 = pd.DataFrame(np.random.randn(8, 1), columns=['A'], dtype='float32')

In [436]:
df1

          A
0 -0.413625
1  0.972027
2 -0.977208
3 -1.659892
4 -0.735129
5  0.910707
6  0.679031
7  2.088477

In [437]:
df1.dtypes

A    float32
dtype: object

In [438]:
df2 = pd.DataFrame(dict( A = pd.Series(np.random.randn(8), dtype='float16'),
                         B = pd.Series(np.random.randn(8)),
                         C = pd.Series(np.array(np.random.randn(8), dtype='uint8')) ))

In [439]:
df2

          A         B    C
0 -0.077637  0.723455    1
1 -1.627930 -0.558913    0
2  0.643066  0.375315    1
3  2.304688 -0.065649    0
4 -2.306641 -1.174541    1
5 -0.461670 -1.377454  255
6  0.386719  1.427348    0
7 -0.240845 -1.043456    0

In [440]:
df2.dtypes

A    float16
B    float64
C      uint8
dtype: object

### defaults

By default integer types are int64 and float types are float64, REGARDLESS of platform (32-bit or 64-bit). The following will all result in int64 dtypes.

In [441]:
pd.DataFrame([1, 2], columns=['a']).dtypes

a    int64
dtype: object

In [442]:
pd.DataFrame({'a': [1, 2]}).dtypes

a    int64
dtype: object

In [443]:
 pd.DataFrame({'a': 1 }, index=list(range(2))).dtypes

a    int64
dtype: object

Numpy, however will choose platform-dependent types when creating arrays. The following **WILL** result in int32 on 32-bit platform.

In [445]:
pd.DataFrame(np.array([1, 2])).dtypes

0    int32
dtype: object

### upcasting

Types can potentially be upcasted when combined with other types, meaning they are promoted from the current type (say int to float)

In [447]:
df3 = df1.reindex_like(df2).fillna(value=0.0) + df2

In [448]:
df3

          A         B      C
0 -0.491262  0.723455    1.0
1 -0.655902 -0.558913    0.0
2 -0.334142  0.375315    1.0
3  0.644795 -0.065649    0.0
4 -3.041769 -1.174541    1.0
5  0.449037 -1.377454  255.0
6  1.065750  1.427348    0.0
7  1.847633 -1.043456    0.0

In [449]:
df3.dtypes

A    float32
B    float64
C    float64
dtype: object

The values attribute on a DataFrame return the lower-common-denominator of the dtypes, meaning the dtype that can accommodate **ALL** of the types in the resulting homogeneous dtyped numpy array. This can force some upcasting.

In [450]:
df3.values.dtype

dtype('float64')

### astype

You can use the **astype()** method to explicitly convert dtypes from one to another. These will by default return a copy, even if the dtype was unchanged (pass copy=False to change this behavior). In addition, they will raise an exception if the astype operation is invalid.

Upcasting is always according to the **numpy** rules. If two different dtypes are involved in an operation, then the more general one will be used as the result of the operation.

In [451]:
df3

          A         B      C
0 -0.491262  0.723455    1.0
1 -0.655902 -0.558913    0.0
2 -0.334142  0.375315    1.0
3  0.644795 -0.065649    0.0
4 -3.041769 -1.174541    1.0
5  0.449037 -1.377454  255.0
6  1.065750  1.427348    0.0
7  1.847633 -1.043456    0.0

In [452]:
# conversion of dtypes
df3.astype('float32').dtypes

A    float32
B    float32
C    float32
dtype: object

### object converstion

**convert_objects()** is a method to try to force conversion of types from the object dtype to other types. To force conversion of specific types that are number like, e.g. could be a string that represents a number, pass convert_numeric=True. This will force strings and numbers alike to be numbers if possible, otherwise they will be set to np.nan.

In [453]:
df3['D'] = '1.'

In [454]:
df3['E'] = '1'

In [455]:
df3.convert_objects(convert_numeric=True).dtypes

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  if __name__ == '__main__':

A    float32
B    float64
C    float64
D    float64
E      int64
dtype: object

In [456]:
# same, but specific dtype conversion
df3['D'] = df3['D'].astype('float16')

In [459]:
df3['E'] = df3['E'].astype('int32')

In [460]:
df3.dtypes

A    float32
B    float64
C    float64
D    float16
E      int32
dtype: object

To force conversion to datetime64[ns], pass convert_dates='coerce'. This will convert any datetime-like object to dates, forcing other values to NaT. This might be useful if you are reading in data which is mostly dates, but occasionally has non-dates intermixed and you want to represent as missing.

In [463]:
import datetime

s = pd.Series([datetime.datetime(2001,1,1,0,0),
               'foo', 1.0, 1, pd.Timestamp('20010104'),
               '20010105'], dtype='O')

In [464]:
s

0    2001-01-01 00:00:00
1                    foo
2                      1
3                      1
4    2001-01-04 00:00:00
5               20010105
dtype: object

In [465]:
pd.to_datetime(s, errors='coerce')

0   2001-01-01
1          NaT
2          NaT
3          NaT
4   2001-01-04
5   2001-01-05
dtype: datetime64[ns]

In addition, **convert_objects()** will attempt the soft conversion of any object dtypes, meaning that if all the objects in a Series are of the same type, the Series will have that dtype.

### gotchas

Performing selection operations on integer type data can easily upcast the data to floating. The dtype of the input data will be preserved in cases where nans are not introduced (starting in 0.11.0) See also [integer na gotchas](http://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas-intna)

In [466]:
dfi = df3.astype('int32')

In [467]:
dfi['E'] = 1

In [468]:
dfi

   A  B    C  D  E
0  0  0    1  1  1
1  0  0    0  1  1
2  0  0    1  1  1
3  0  0    0  1  1
4 -3 -1    1  1  1
5  0 -1  255  1  1
6  1  1    0  1  1
7  1 -1    0  1  1

In [469]:
dfi.dtypes

A    int32
B    int32
C    int32
D    int32
E    int64
dtype: object

In [476]:
casted = dfi[dfi>0]

In [477]:
casted

     A    B      C  D  E
0  NaN  NaN    1.0  1  1
1  NaN  NaN    NaN  1  1
2  NaN  NaN    1.0  1  1
3  NaN  NaN    NaN  1  1
4  NaN  NaN    1.0  1  1
5  NaN  NaN  255.0  1  1
6  1.0  1.0    NaN  1  1
7  1.0  NaN    NaN  1  1

In [478]:
casted.dtypes

A    float64
B    float64
C    float64
D      int32
E      int64
dtype: object

While float dtypes are unchanged.

In [480]:
dfa = df3.copy()

In [481]:
dfa['A'] = dfa['A'].astype('float32')

In [482]:
dfa.dtypes

A    float32
B    float64
C    float64
D    float16
E      int32
dtype: object

In [483]:
casted = dfa[df2>0]

In [484]:
casted

          A         B      C   D   E
0       NaN  0.723455    1.0 NaN NaN
1       NaN       NaN    NaN NaN NaN
2 -0.334142  0.375315    1.0 NaN NaN
3  0.644795       NaN    NaN NaN NaN
4       NaN       NaN    1.0 NaN NaN
5       NaN       NaN  255.0 NaN NaN
6  1.065750  1.427348    NaN NaN NaN
7       NaN       NaN    NaN NaN NaN

In [485]:
casted.dtypes

A    float32
B    float64
C    float64
D    float16
E    float64
dtype: object

## Selecting columns based on dtype

New in version 0.14.1.

The **select_dtypes()** method implements subsetting of columns based on their dtype.

First, let’s create a **DataFrame** with a slew of different dtypes:

In [487]:
df = pd.DataFrame({'string': list('abc'),
                    'int64': list(range(1, 4)),
                    'uint8': np.arange(3, 6).astype('u1'),
                    'float64': np.arange(4.0, 7.0),
                    'bool1': [True, False, True],
                    'bool2': [False, True, False],
                    'dates': pd.date_range('now', periods=3).values,
                    'category': pd.Series(list("ABC")).astype('category')})

In [488]:
df

   bool1  bool2 category                   dates  float64  int64 string  uint8
0   True  False        A 2016-08-30 15:23:58.933      4.0      1      a      3
1  False   True        B 2016-08-31 15:23:58.933      5.0      2      b      4
2   True  False        C 2016-09-01 15:23:58.933      6.0      3      c      5

In [490]:
df['tdeltas'] = df.dates.diff()

In [491]:
df['uint64'] = np.arange(3, 6).astype('u8')

In [492]:
df['other_dates'] = pd.date_range('20130101', periods=3).values

In [493]:
df['tz_aware_dates'] = pd.date_range('20130101', periods=3, tz='US/Eastern')

In [494]:
df

,bool1,bool2,category,dates,float64,int64,string,uint8,tdeltas,uint64,other_dates,tz_aware_dates
0,True,False,A,2016-08-30 15:23:58.933,4.0,1,a,3,NaT,3,2013-01-01,2013-01-01 00:00:00-05:00
1,False,True,B,2016-08-31 15:23:58.933,5.0,2,b,4,1 days,4,2013-01-02,2013-01-02 00:00:00-05:00
2,True,False,C,2016-09-01 15:23:58.933,6.0,3,c,5,1 days,5,2013-01-03,2013-01-03 00:00:00-05:00

And the dtypes

In [495]:
df.dtypes

bool1                                   bool
bool2                                   bool
category                            category
dates                         datetime64[ns]
float64                              float64
int64                                  int64
string                                object
uint8                                  uint8
tdeltas                      timedelta64[ns]
uint64                                uint64
other_dates                   datetime64[ns]
tz_aware_dates    datetime64[ns, US/Eastern]
dtype: object

**select_dtypes()** has two parameters include and exclude that allow you to say “give me the columns WITH these dtypes” (include) and/or “give the columns WITHOUT these dtypes” (exclude).

For example, to select bool columns

In [496]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

You can also pass the name of a dtype in the [numpy dtype hierarchy](https://docs.scipy.org/doc/numpy/reference/arrays.scalars.html):

In [497]:
 df.select_dtypes(include=['bool'])

   bool1  bool2
0   True  False
1  False   True
2   True  False

**select_dtypes()** also works with generic dtypes as well.

For example, to select all numeric and boolean columns while excluding unsigned integers

In [498]:
df.select_dtypes(include=['number', 'bool'], exclude=['unsignedinteger'])

   bool1  bool2  float64  int64  tdeltas
0   True  False      4.0      1      NaT
1  False   True      5.0      2   1 days
2   True  False      6.0      3   1 days

To select string columns you must use the object dtype:

In [499]:
df.select_dtypes(include=['object'])

  string
0      a
1      b
2      c

To see all the child dtypes of a generic dtype like numpy.number you can define a function that returns a tree of child dtypes:

In [501]:
def subdtypes(dtype):
     subs = dtype.__subclasses__()
     if not subs:
         return dtype
     return [dtype, [subdtypes(dt) for dt in subs]]

All numpy dtypes are subclasses of numpy.generic:

In [502]:
subdtypes(np.generic)

[numpy.generic,
 [[numpy.number,
   [[numpy.integer,
     [[numpy.signedinteger,
       [numpy.int8,
        numpy.int16,
        numpy.int32,
        numpy.int32,
        numpy.int64,
        numpy.timedelta64]],
      [numpy.unsignedinteger,
       [numpy.uint8,
        numpy.uint16,
        numpy.uint32,
        numpy.uint32,
        numpy.uint64]]]],
    [numpy.inexact,
     [[numpy.floating,
       [numpy.float16, numpy.float32, numpy.float64, numpy.float64]],
      [numpy.complexfloating,
       [numpy.complex64, numpy.complex128, numpy.complex128]]]]]],
  [numpy.flexible,
   [[numpy.character, [numpy.string_, numpy.unicode_]],
    [numpy.void, [numpy.record]]]],
  numpy.bool_,
  numpy.datetime64,
  numpy.object_]]

**Note:** Pandas also defines the types category, and datetime64[ns, tz], which are not integrated into the normal numpy hierarchy and wont show up with the above function.

**Note:** The include and exclude parameters must be non-string sequences.